Repository: alvarogois/dans-gdrive-wp-plugin
Catalog: languages/dgdrive-*.po
Languages: pt_pt

source: DL
pt_pt: Descarregar

source: Export
pt_pt: Exportar

source: View
pt_pt: Ver

source: Dan's Google Drive Viewer Settings
pt_pt: Configuração do Dan's Google Drive Viewer

source: Welcome! This is a basic Google Drive Viewer integration plugin, with the following features.
pt_pt: Olá! Este plugin faz uma integração básica do Google Drive Viewer, com as seguintes características:

source: Displays public drive document listings in a mobile friendly format
pt_pt: Mostra uma lista de documentos de uma drive pública num formato amigável para dispositivos móveis

source: Offers both View and Download Options, where appropriate
pt_pt: Quando possível, apresenta duas opções, ver e descarregar

source: All options are configured via shortcode
pt_pt: Todas as opções são configuradas através de shortcode

source: Offers Export Option for Google Docs / Sheets / Presentations
pt_pt: Apresenta uma opção de exportação para Google Docs/Folhas/Apresentações

source: Allows Drill Down / Up without Leaving the Page
pt_pt: Permite retroceder/avançar nas pastas sem sair da página

source: Default Display [dandrive] (defaults to 1st drive)
pt_pt: Apresentação básica [dandrive] (por omissão, mostra a drive 1)

source: Optional Attributes Ex:[dandrive drive=1 divid=mydrive height=400 width=300 rbutton=no]
pt_pt: Exemplo de outros atributos: [dandrive drive=1 divid=mydrive height=400 width=300 rbutton=no]

source: drive= (number of the drive you want, defaults to 1 if not entered)
pt_pt: drive= (número da pasta pretendida, se estiver em branco mostra a 1)

source: divid= (id of the div your calendar is stored in, for custom theming. Defaults to random string to allow multiple per page)
pt_pt: divid= (id da div em que o calendário está guardado, para personalização do aspecto. Por omissão mostra uma string aleatória para permitir várias ocorrências por página)

source: height= (maximum height in pixels, defaults to auto. If this is set, a scroll bar will appear if your div overflows. Enter a number only).
pt_pt: height= (altura máxima em pixels, por omissão auto. Se estiver definida e o conteúdo for mais extenso, apresenta uma barra de navegação à direita. Introduzir apenas um número, sem px).

source: width = (maximum width in pixels, defaults to 400. Enter a number only)
pt_pt: width = (largura máxima em pixels, por omissão 400. Introduzir apenas um número, sem px).

source: rbutton = (no, to not display return to initial folder button, if you have files only in the folder directly linked with no subfolders. Otherwise, leave this attribute off).
pt_pt: rbutton = (no, para não mostrar o botão de regresso à pasta inicial, se só existem ficheiros na pasta partilhada e não existem subpastas. Senão, deixar o atributo inactivo).

source: To create API key, visit <a href="https://console.developers.google.com/" target="_blank">Google Developers Console</a> Then, follow bellow;
pt_pt: Para criar a API key, visitar a <a href="https://console.developers.google.com/" target="_blank">Google Developers Console</a> Depois, seguir as indicações abaixo;

source: Create new project (or use project you created before).
pt_pt: Criar um novo projecto (ou usar um projecto já criado).

source: Check "APIs & auth" -> "Credentials" on side menu.
pt_pt: Escolher "APIs & auth" -> "Credentials" no menu lateral.

source: Hit "Create new Key" button on "Public API access" section.
pt_pt: Clicar o botão "Create new Key" na secção "Public API access".

source: Choose "Browser key" and keep blank on referer limitation.
pt_pt: Escolher "Browser key" e deixar em branco a opção “referer limitation”.

source: API KEY - Google Drive Viewer (All REQUIRED)
pt_pt: API KEY - Google Drive Viewer (TODAS OBRIGATÓRIAS)

source: Add Row
pt_pt: Adicionar entrada

source: Type
pt_pt: Tipo

source: Download
pt_pt: Descarregar

source: Return To Initial Folder
pt_pt: Retornar à pasta inicial

source: Loading Drive Folder...
pt_pt: A carregar a pasta Google...

source: A custom Google Drive Viewer w/ Folder Transversal and File Export
pt_pt: Um Google Drive Viewer personalizado, com navegação de pastas e exportação de documentos
